Autodesk.Revit.DB.Categories.NewSubcategory(Autodesk.Revit.DB.Category,System.String)
Add a new subcategory into the Autodesk Revit document.
Returns: If successful, the newly created subcategory.
parentCategory:  The parent category.
name:  The new category name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"parentCategory" or "name"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"parentCategory"-cannot add subcategory.
Thrown when the input argument-"name"-is an illegal name.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when subcategory creation failed.

Autodesk.Revit.DB.Categories.Insert(System.String,Autodesk.Revit.DB.Category)
Inserts the specified category with the specified name into the map.
key: The name to be used for inserting the category into the map.
item: The category to be inserted into the map.
Returns: Whether or not the category was inserted into the map.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Always thrown; this list is read only.

Autodesk.Revit.DB.Categories.ReverseIterator
Retrieves a backward moving iterator to the map.
Returns: A backward moving iterator to the map.

Autodesk.Revit.DB.Categories.GetEnumerator
Retrieves a forward moving iterator to the map.
Returns: A forward moving iterator to the map.

Autodesk.Revit.DB.Categories.ForwardIterator
Retrieves a forward moving iterator to the map.
Returns: A forward moving iterator to the map.

Autodesk.Revit.DB.Categories.IsEmpty
Whether or not the list of top-level categories is empty.

Autodesk.Revit.DB.Categories.Size
The total number of top-level categories in the document.

Autodesk.Revit.DB.Categories.Item(System.String)
Gets a category which has the specified name from this list of top-level categories.
name: The name of the category to be retrieved.
The category with the specified name.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when the category list does not contain the category with this name.
Thrown when trying to set an item to this list of categories; this list is read only..

Autodesk.Revit.DB.Categories.Contains(System.String)
Identifies if a category which has the specified name is in the list of top-level categories.
name: The name of the category to be retrieved.
Whether the category exists in the list of top-level categories.

Autodesk.Revit.DB.Categories.Item(Autodesk.Revit.DB.BuiltInCategory)
Retrieves a category object matching an identifier.
Retrieves a category object corresponding to a BuiltInCategory id.
Remarks:  Unlike the method that obtains categories by name, this routine will obtain
the handle even of built-in subcategories.
Since 2016 it is advised to use either ​Autodesk::​Revit::DB::​Category::​GetCategory(​Document,​BuiltIn​Category)
or ​Autodesk::​Revit::DB::​Category::​GetCategory(​Document,​ElementId)​ method from Category class.

Autodesk.Revit.DB.Categories
The Categories object is a map that contains all the top-level Category objects within the Document.
Remarks: Use this object to retrieve categories by name or by BuiltInCategory id.